# წარმოიდგინე, რომ წერ პროგრამას კინოთეატრისთვის. უნდა შექმნა ფუნქცია, რომელიც წყვეტს, რა ფასის ბილეთი უნდა იყიდოს ადამიანმა მისი ასაკის მიხედვით.
# პირობა:
# დაწერე ფუნქცია სახელად check_ticket_price, რომელსაც არგუმენტად გადაეცემა ასაკი.
# ფუნქციის შიგნით გამოიყენე if-elif-else ლოგიკა:
# თუ ასაკი ნაკლებია 12-ზე, ფუნქციამ უნდა დააბრუნოს ტექსტი: "ბილეთი უფასოა".
# თუ ასაკი არის 12-დან 18 წლამდე, უნდა დააბრუნოს: "ბილეთის ფასი არის 10 ლარი".
# სხვა ნებისმიერ შემთხვევაში (18+), უნდა დააბრუნოს: "ბილეთის ფასი არის 20 ლარი".



age = int(input("Enter your age: "))

def check_ticket_price(age):
    if age < 12:
        print('ბილეთი უფასოა')
    elif 12 <= age < 18:
        print('ბილეთის ფასი არის 10 ლარი')
    else:
        print('ბილეთის ფასი არის 20 ლარი')

print(check_ticket_price(age))
    

# წარმოიდგინე, რომ ხარ გუნდის მწვრთნელი და გაქვს ფეხბურთელების სია:
# players = ["მესი", "რონალდო", "ნეიმარი"]
# შეასრულე ეს 4 ნაბიჯი:
# 1) append: გუნდში დაიმატე ახალი ფეხბურთელი "კვარაცხელია" (ბოლოში).
# 2) insert: სიაში მეორე ადგილზე (ანუ ინდექსით 1) ჩასვი ფეხბურთელი "მბაპე".
# 3) pop: გუნდიდან გაუშვი ყველაზე ბოლო ფეხბურთელი (ვინც append-ით დაამატე).
# 4) len: ბოლოს დაბეჭდე ეკრანზე, სულ რამდენი ფეხბურთელი დაგრჩა გუნდში.

players = ["მესი", "რონალდო", "ნეიმარი"]

players.append('კვარაცხელია')
players.insert(1, 'მბაპე')
players.pop(2)
print(len(players))



# წარმოიდგინე, რომ მართავ ბანკის რიგს. თავიდან რიგში დგანან:
# queue = ["ანი", "დათო", "ლუკა"]
# შეასრულე ეს მოქმედებები:
# append: მოვიდა ახალი კლიენტი "გიორგი" და დადგა რიგის ბოლოში.
# insert: მოვიდა "ვეტერანი კლიენტი", რომელიც რიგის გარეშე უნდა შევიდეს და ჩასვი ის სიაში ყველაზე წინ (ინდექსი 0).
# pop: პირველი კლიენტი (ვინც ყველაზე წინ დგას) უკვე მოემსახურნენ და ამოაგდე რიგიდან.
# მიგინიშნებ: pop(0) ამოაგდებს პირველ ელემენტს.
# len: ბოლოს დაბეჭდე ეკრანზე: "რიგში დარჩა [რიცხვი] ადამიანი".


queue = ["ანი", "დათო", "ლუკა"]

queue.append('გიორგი')
queue.insert(0, 'ვეტერანი კლიენტი')
queue.pop(0)

print('რიგში დარჩა', len(queue), 'ადამიანი')

