# შედარებითი ოპერატორები არსებობს რამოდენიმე სახის, ჩვენ რაც ვიცით ესენია : <,>,<=,>=
# boolean არის მონაცემის ტიპი, რომელსაც აქვს ორი მნიშვნელობა: ჭეშმარიტი და სიცრუე

# შედ. ოპერატორების მაგალითებია:
 #1. 210 < 60
 #2. 789 > 1034
 #3. 67 >= 61
 #4. 45 <= 78
 #5. 60 = 60

# მაგალითი ლოგიკურ ოპერატორებზე:
 # True and True -->True
 # False and False --> False
 # Frue or False --> True
 # True and False --> False
 # True or False and False and True or False and True and False --> False

# დავალება. შევადაროთ ლოგიკური ოპერატორები ნამდვილ სიცოცხლეს.
# ?

