# or -ი ლოგიკური oპერატორის დროს ერთი true უნდა იყოს მაინც რომ true გამოვიდეს
# and -ი ლოგიკური ოპერატორის შემთხვევაში თუ მაგ true and false ეწერება გამოიტანს false-ს ამიტომ and ლოგიკური ოპერატორის დროს თუ გვინდა რომ true გამოიტანოს უნდა ეწეროს ორივე true ანუ true and true
# < --> მეტია (ანუ ერთი რიცხვი მეორეზე მეტია)
# > --> ნაკლებია (ანუ ერთი რიცხვი მეორეზე ნაკლებია)
# == --> ტოლია (ანუ ორივე რიცხვი ერთმანეთის ნაირია/ტოლია)
# =! --> არ უდრის (ანუ ერთი რიცხვი არ არის მეორე რიცხვის შესაბამისი)
# >= --> მეტია ან ტოლია (ანუ ერთი რიცხვი მეორეზე ან მეტია ან ნაკლებია)
# <= --> ნაკლებია ან ტოლია (ანუ ერთი რიცხვი მეორე რიცხვზე ან ნაკლებია ან ტოლია)

