# 1) შექმენით 1 ცვლადი რომელშიც შეინახავთ რაიმე სტრინგს. შენი დავალებაა რომ ეს სტრინგი გადააქცია დიდ ასოიან სტრინგად

name = 'Anastasia'.upper()
print(name)

# 2) იგივე გააკეთეთ რაც პირველი ოღონდ სტრინგი პატარა ასოებად გადააქციეთ

name = 'Anastasia'.lower()
print(name)

# 3) მომხმარებელს შემოატანანეთ თავისი სახელი. შენი დავალებაა რომ მისი სახელის პირველი ასო იწყებოდეს დიდი ასოთი

nm = input("Enter your name: ")
print(nm.capitalize())

# 4) კომენტარის სახით ახსენით რა არის dot notation და რისთვის გამოიყენება


# dot notation არის წერის მეთოდი, რომლის საშუალებით ცვლადის შემდეგ წერტილის  გამოყენებით შეგვიძლია
# გამოვიძახოთ მისი ფუნქციები და შევცვალოთ ტექსტი, მაგ: ყველა ასო გავადიდოთ, დავაპატარავოთ 
# და  სიტყვის ან წინადადების პირველი ასო გავადიდოთ.




