#1)შექმენით სია, 10 ელემენტით, ნებისმიერი მონაცემთა ტიპის, შემდეგ მომხარებელს შემოატანინეთ 2 ცალი რიცხვი,
#პირველი რიცხვი რაც შემოიტანეს მაგ ინდექსზე მდგომი ელემენტი გამოიტანეთ,
#და  მეორე რიცხვი რაც შემოიტანეს სიაში მაგ ინდექსზე მდგომი ელემენტი შეცვალეთ "new element" ით

random = [7, "Hello", 3.14, False, True, "world", "python", 267, 90, -100]

index1 = int(input("შეიყვნე პირველი ინდექსი: "))
print("ელემენტი", random[index1])

index2 = int(input("შეიყვანე მეორე ინდექსი: "))
random[index2] = "new element"

print("ახალი სია", random)


my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 19, 20]
print("ბოლო ელემენტი", my_list[-1])
print("პირველი ელემენტი", my_list[-20])

