# 1) შექმენი ცვლადი სახელად password და შეინახეთ რაიმე მნიშვნელობა, ასვე მომხმარებელს შემოაყვანინე პაროლი და თუ არ 
# დაემთხვა მომხმარებლის შემოყვანილი მნიშვნელობა შენს პაროლს, დაბეჭდე "შენი პაროლი სწორია"
# ხოლო თუ არასწორ პაროლს შემოიტანს განმეორდეს ინფუთი რომ კიდევ სცადოს თავიდან შეყვანა პაროლის.

password = "12344321"   

user_password = input("შეიყვანე პაროლი: ")

while user_password != password:
    print("პაროლი არასწორია, სცადე თავიდან.")
    user_password = input("შეიყვანე პაროლი: ")

print("შენი პაროლი სწორია")




# 2) for loop ის საშუალებით გამოიტანეთ ტერმინალში 1 დან 100 ამდე კენტი რიცხვები.

for i in range(1, 101, 2):
    print(i)

# 3) while loop ის საშუალები გამოიტანეთ ტერმინალში 0 იდან 50 ამდე ლუწი რიცხვები.

num = 0

while num <= 50:
    print(num)
    num += 2

# 4) მომხმარებელს შემოატანინე რიცხვი და შეამოწმე თუ მეტია ან ტოლი 18 ზე დაბეჭდე 
# "შენ ხარ სრულწლოვანი" ხოლო სხვა შემთხვევაში "შენ არ ხარ სრულწლოვანი"


age = int(input("შეიყვანე ასაკი: "))

if age >= 18:
    print("შენ ხარ სრულწლოვანი")
else:
    print("შენ არ ხარ სრულწლოვანი")

# 5) შექმენი ფუნქიცა რომელსაც გადაეცემა 2 არგუმენტი და საბოლოოდ ამ ორ რიცხვზე მოახდინეთ მათემატიკური ოპერატორები.

def math_operations(a, b):
    print("მიმატება:", a + b)
    print("გამოკლება:", a - b)
    print("გამრავლება:", a * b)
    print("გაყოფა:", a / b)
    print("გაყოფა:", a // b)


num1 = int(input("შეიყვანე პირველი რიცხვი: "))
num2 = int(input("შეიყვანე მეორე რიცხვი: "))

math_operations(num1, num2)