# 1) შექმენით 1 ცვლადი რომელშიც შეინახავთ რაიმე სტრინგს. შენი დავალებაა რომ ეს სტრინგი გადააქცია დიდ ასოიან სტრინგად

name = 'Anastasia'
print(name.upper())

# 2) იგივე გააკეთეთ რაც პირველი ოღონდ სტრინგი პატარა ასოებად გადააქციეთ

name = 'Anastasia'
print(name.lower())

# 3) მომხმარებელს შემოატანანეთ თავისი სახელი. შენი დავალებაა რომ მისი სახელის პირველი ასო იწყებოდეს დიდი ასოთი

name = input('Enter your name: ')
print(name.capitalize())

# 4) კომენტარის სახით ახსენით რა არის dot notation და რისთვის გამოიყენება

# dot notation არის წერის მეთოდი, რომლის საშუალებით ცვლადის შემდეგ წერტილის  გამოყენებით შეგვიძლია
# გამოვიძახოთ მისი ფუნქციები და შევცვალოთ ტექსტი, მაგ: ყველა ასო გავადიდოთ, დავაპატარავოთ 
# და  სიტყვის ან წინადადების პირველი ასო გავადიდოთ.

# 5) მომხმარებელს შემოაყვანინეთ თავისი გვარი და გაიგეთ რომელ ინდექსზე არის მათ გვარში ასო "e" და გამოიტანეთ ესეთ სტილში
# "ასო e თქვენს გვარში არის ინდექს {ინდექსი}-ზე.
# თუ ასო "e" არ არის მომხმარებლის გვარში მაშინ უბრალოდ დაპრინტეთ "თქვენს გვარში არ არის ასო e"

surname = input('Enter your surname')

found = False 
i = 0

for letter in surname:
    if not found and letter == 'e':
        print('ასო e თქვენს გვარში არის ინდექს', i, 'ზე')
        found = True
    i = i + 1

if not found:
    print('თქვენს გვარში არ არის ასო e')


