# control flow- არის თუ რა ეტაპით შესრულდება კოდი 
# control flow შედგება 3 ნაწილისგან რომლებიც ესენია : sequence,selection და iteration
# sequence - პირდაპირ ასრულებს მოცემულ დავალებას
# selection - ირჩევს
# iteration - იმეორებს 
# ალგორითმი როგორც ვთქვათ არის მოცემული რეცეპტი მაგალითად ნამდვილი ცხოვრებიდან რომ მოვიყვანოთ იქნება რომ მივყვეთ რეცეპტს თუ როგორ მზადდება ნამცხვარი ან ნებისმიერი მოცემული რეცეპტი ზუსტად როგორც აღწერილია რეცეპტზე

# for ციკლს ვიყენებთ იმ შემთხვევაში როდესაც ვიცით წინასწარ თუ რამდეჯერ შესრულდება კოდი
# for კარგი არის რადგან უფრო გასაგები და უფრო მარტივი სინტაქსი აქვს
# მაგ: for i in range(1, 6): 
#    print(i)
# და
# for i in range(1, 12): 
#    print(i)
#while ციკლს ვიყენებთ იმ შემთხვევაში როდესაც ზუსტად არ ვიცით თუ რამდეჯერ შესრულდება კოდი
# მაგ : 
i = 1
while i <= 5:
    print(i)
    i += 1

i = 1
while i <= 8:
    print(i)
    i += 1