# + მიმატება
# - გამოკლება
# * გამრავლება
# / გაყოფა (პასუხი გამოაქვს როგორც float)
# // გაყოფა (ეს გვიჩვენებს:რიცხვი თუ რამდენჯერ მოთავსდება ერთი რიცხვი მეორეში და პასუხი გამოაქვს როგორც integer)

num1 = 94
num2 = 5

print(num1 + num2)
print(num1 - num2)
print(num1 * num2)
print(num1 / num2)
print(num1 // num2)

price = 94
print(price - 12)

score = 100
print(score * 35)

name = 'barbare'
name = 'lika'
name = 'salome'
print(name)

# (ეს კოდი გამოიტანს მხოლოდ ბოლოს დაწერილ სახელს რადგან კომპიუტერი ყურადრებას ანიჭებს ბოლოს დაწერილ
# სახელს იმ შემთხვევაში თუ მოცემულია რამოდენიმე სახელი და დაბეჭვდვას ითხოვს.
# ასევე კომპიუტერი დათვლას იწყებს ბოლოდან რის გამოც დაიბეჭდება სახელი 'salome')
