my_list = [10, 20, 30, 40, 50]

# ინდექსი არის ელემენტის პოზიცია ლისტში,
# ანუ ზემოთ მოცემული 30-ის პოზიცია იქნება 2-ე რადგან 0-დან იწყება ათვლა

my_list[1]= 100
print(my_list[3])


# ცვლადს შეუძლია შეინახოს მხოლოდ ერთი მნიშვნელობა, ხოლო ლისტს შეუძლია შეინახოს რამდენიმე 
# მნიშვნელობა ერთდროულად, ასევე ლისტს შეუძლია რამდენიმე მონაცემთა ტიპის მნიშვნელობა შეინახოს
# მაგ: string,boolean,float და სხვა.
# ინდექსი გვაქვს რადგან ლისტში აქვთ პოზიციები თითოეულ ელემენტებს, მაგ:
name = ["Ana", "Lizi", "Teodora", "Tekla"]
# აქ Lizi პოზიიცით იქნება 1 რადგან ათვლა ნულიდან იწყება
# ინდექსების საშუალებით შეგვიძლია შევცვალოთ ელემენტი. ასევე გადავაქციოთ ერთი ელემენტი სხვად და
# შემდგომ გამოვატანინოთ.

