# range()- ეს ფუნქცია ასრულებს თუ როდის დაიწყოს რიცხვის ათვლა და როდის შეწყვიტოს, ასევე აქვს მესამე ფუნქცია რომელიც საზღვრავს თუ რამდენი რიცხვი გამოტოვოს როდესაც რიხვის ათვლას იწყებს.
# for loop- იმეორებს კოდს რამდენჯერმე 
# მაგ: 
for i in range (5):
    print(i)

for i in range(10):
    print(i)

# while loop-იმეორებს კოდს სანამ პირობა true  არ გამოვა
# მაგ:
i = 1
while i < 5:
    print(i)
    i += 1

i = 1 
while i < 7:
    print(i)
    i += 1

# ალგორითმი ნამდვილი ცხოვრებიდან რომ მოვიყვანოთ იქება რეცეპტის მაგალითი ანუ ისე მიყოლა როგორც საჭიროა და მოცემულია.
# მაგ: 
# 1. ერთი დღის ჩამოწერილი გეგმების შესრულება
# 2. ნამცხვრის გამოცხობა ნაბიჯ-ნაბიჯ
# 3. ტელეფონის განბლოკვა 

